

print(f"Средний возраст - {df['Возраст'].mean()}")
print(f"Медианный возраст - {df['Возраст'].median()}")
print(f"Стандартное отклонение возраста - {df['Возраст'].std()}")

print(f"Средняя зарплата - {df['Зарплата'].mean()}")
print(f"Медианная зп - {df['Зарплата'].median()}")
print(f"Стандартное отклонение зп - {df['Зарплата'].std()}")




Q1 = df['value'].quantile(0.25)
Q3 = df['value'].quantile(0.75)
IQR = Q3 - Q1

# print(df.describe())
print(f"Средняя оценка по предметам - {df['Возраст'].mean()}")
print(f"Медианная оценка по предметам - {df['Возраст'].median()}")
print(f"Стандартное отклонение по предметам - {df['Возраст'].std()}")